Австралия/src/Reports/StatementOfAccount/StatementOfAccount.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>StatementOfAccount</name>
</mdclass:Report>

Австралия/src/Catalogs/CounterpartyContracts/CounterpartyContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CounterpartyContracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractForm</name>
    <type>
      <types>CatalogRef.ContractForms</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractKind</name>
    <type>
      <types>EnumRef.ContractType</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.CounterpartyContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProvideEPD</name>
    <type>
      <types>EnumRef.VariantsOfProvidingEPD</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.CounterpartyContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTermsTemplate</name>
    <type>
      <types>CatalogRef.PaymentTermsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OverdueLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectDebitMandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.ShippingAddresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovePurchaseOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LimitWithoutApproval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VisibleToExternalUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesOfPayment</name>
    <attributes>
      <name>Term</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>BaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>DuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EarlyPaymentDiscounts</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Reports/StatementOfAccount/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
	
#Region EventHandlers

Procedure OnComposeResult(ResultDocument, DetailsData, StandardProcessing)

	StandardProcessing = False;
	
	ReportSettings = SettingsComposer.GetSettings();
	ReportParameters = PrepareReportParameters(ReportSettings);
	
	DriveReports.SetReportAppearanceTemplate(ReportSettings);
	DriveReports.OutputReportTitle(ReportParameters, ResultDocument);
	
	TemplateComposer = New DataCompositionTemplateComposer;
	CompositionTemplate = TemplateComposer.Execute(DataCompositionSchema, ReportSettings, DetailsData);

	// Create and initialize a composition processor
	CompositionProcessor = New DataCompositionProcessor;
	CompositionProcessor.Initialize(CompositionTemplate, , DetailsData, True);

	// Create and initialize the result output processor
	OutputProcessor = New DataCompositionResultSpreadsheetDocumentOutputProcessor;
	OutputProcessor.SetDocument(ResultDocument);

	// Indicate the output begin
	OutputProcessor.BeginOutput();
	TableFixed = False;

	ResultDocument.FixedTop = 0;
	// Main cycle of the report output
	While True Do
		// Get the next item of a composition result
		ResultItem = CompositionProcessor.Next();

		If ResultItem = Undefined Then
			// The next item is not received - end the output cycle
			Break;
		Else
			// Fix header
			If  Not TableFixed 
				  AND ResultItem.ParameterValues.Count() > 0 
				  AND TypeOf(SettingsComposer.Settings.Structure[0]) <> Type("DataCompositionChart") Then

				TableFixed = True;
				ResultDocument.FixedTop = ResultDocument.TableHeight;

			EndIf;
			// Item is received - output it using an output processor
			OutputProcessor.OutputItem(ResultItem);
		EndIf;
	EndDo;

	OutputProcessor.EndOutput();
	
EndProcedure

Function PrepareReportParameters(ReportSettings)
	
	BeginOfPeriod = Date(1,1,1);
	EndOfPeriod  = Date(1,1,1);
	Period = Date(1,1,1);
	TitleOutput = False;
	Title = "StatementOfAccount";
	
	VariantBalance = False;
	
	ParameterPeriod = ReportSettings.DataParameters.FindParameterValue(New DataCompositionParameter("EndOfPeriod"));
	If ParameterPeriod <> Undefined AND ParameterPeriod.ViewMode = DataCompositionSettingsItemViewMode.QuickAccess Then
		VariantBalance = True;
		If ParameterPeriod.Use Then
			If TypeOf(ParameterPeriod.Value) = Type("StandardBeginningDate") Then
				ParameterPeriod.Value.Date = EndOfDay(ParameterPeriod.Value.Date);
				Period = Format(ParameterPeriod.Value.Date, "DLF=D");
			Else
				ParameterPeriod.Value = EndOfDay(ParameterPeriod.Value);
				Period = Format(ParameterPeriod.Value, "DLF=D");
			EndIf;
		EndIf;
	EndIf;
	
	If Not VariantBalance Then
		ParameterPeriod = ReportSettings.DataParameters.FindParameterValue(New DataCompositionParameter("Period"));
		If ParameterPeriod <> Undefined AND ParameterPeriod.ViewMode = DataCompositionSettingsItemViewMode.QuickAccess Then
			If ParameterPeriod.Use
				AND ValueIsFilled(ParameterPeriod.Value) Then
				
				BeginOfPeriod = ParameterPeriod.Value.StartDate;
				EndOfPeriod  = ParameterPeriod.Value.EndDate;
			EndIf;
		EndIf;
	EndIf;
	
	ParameterOutputTitle = ReportSettings.DataParameters.FindParameterValue(New DataCompositionParameter("TitleOutput"));
	If ParameterOutputTitle <> Undefined
		AND ParameterOutputTitle.Use Then
		
		TitleOutput = ParameterOutputTitle.Value;
	EndIf;
	
	OutputParameter = ReportSettings.OutputParameters.FindParameterValue(New DataCompositionParameter("Title"));
	If OutputParameter <> Undefined
		AND OutputParameter.Use Then
		Title = OutputParameter.Value;
	EndIf;
	
	ReportParameters = New Structure;
	If VariantBalance Then
		ReportParameters.Insert("Period"               , Period);
	Else
		ReportParameters.Insert("BeginOfPeriod"        , BeginOfPeriod);
		ReportParameters.Insert("EndOfPeriod"         , EndOfPeriod);
	EndIf;
	ReportParameters.Insert("TitleOutput"        , TitleOutput);
	ReportParameters.Insert("Title"                , Title);
	ReportParameters.Insert("ReportId"      , "StatementOfAccount");
	ReportParameters.Insert("ReportSettings", ReportSettings);
		
	Return ReportParameters;
	
EndFunction

#EndRegion

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.ReportsOptions

// The settings of the common report form of the "Reports options" subsystem.
//
// Parameters:
//   Form - ClientApplicationForm, Undefined - a report form or a report settings form.
//       Undefined when called without a context.
//   OptionKey - String, Undefined - a name of a predefined report option or a UUID of a 
//       user-defined report option.
//       Undefined when called without a context.
//   Settings - Structure - see the return value of
//       ReportsClientServer.GetDefaultReportSettings().
//
Procedure DefineFormSettings(Form, OptionKey, Settings) Export
	
	If UsersClientServer.IsExternalUserSession() Then
		OptionKey = "StatementInCurrencyForExternalUsers";
		Settings.Events.OnCreateAtServer = True;
		Settings.Events.OnLoadVariantAtServer = True;
		Settings.Events.OnLoadUserSettingsAtServer = True;
	EndIf;
	
EndProcedure

Procedure OnCreateAtServer(Form, Cancel, StandardProcessing) Export
	
	Form.Items.ReportOptionsGroup.Visible		= False;
	Form.Items.OtherReportSettingsGroup.Visible = False;
	Form.Items.AllSettings.Visible				= False;
	Form.Items.ReportOptions.Visible			= False;
	Form.Items.ChangeOption.Visible				= False;
	Form.Items.SelectOption.Visible				= False;

	CommonClientServer.SetFormItemProperty(
		Form.Items,
		"SaveOption",
		"Visible",
		False); // If the command is unavailable due to rights, the button disappears.
		
	Form.Items.EditFilterCriteria.Visible = False;
		
	CommonClientServer.SetFormItemProperty(
		Form.Items,
		"SelectSettings",
		"Visible",
		False); // If the command is unavailable due to rights, the button disappears.
	CommonClientServer.SetFormItemProperty(
		Form.Items,
		"SaveSettings",
		"Visible",
		False); // If the command is unavailable due to rights, the button disappears.
		
	CommonClientServer.SetFormItemProperty(Form.Items, "SaveOption", "Visible", False);

EndProcedure

Procedure OnLoadVariantAtServer(ReportForm, Settings) Export
	
	ExternalUserAuthorizationData = ExternalUsers.ExternalUserAuthorizationData();
	Counterparty = ExternalUserAuthorizationData.AuthorizedCounterparty;
	
	If ValueIsFilled(Counterparty) Then
		
		ReportSettings = ReportForm.Report.SettingsComposer.Settings;
		ReportFilter = ReportSettings.Filter;
		
		CommonClientServer.SetFilterItem(ReportFilter, "Counterparty", Counterparty);
		
		DoOperationsByContracts = Common.ObjectAttributeValue(Counterparty, "DoOperationsByContracts");
		If DoOperationsByContracts Then
			Query = New Query;
			Query.Text = "SELECT ALLOWED
			|	CounterpartyContracts.Ref AS Ref
			|FROM
			|	Catalog.CounterpartyContracts AS CounterpartyContracts
			|WHERE
			|	NOT CounterpartyContracts.DeletionMark
			|	AND CounterpartyContracts.Owner = &Owner
			|	AND (CounterpartyContracts.VisibleToExternalUsers
			|			OR &UseContractRestrictionsTurnOff)";
			Query.SetParameter("Owner", Counterparty);
			Query.SetParameter("UseContractRestrictionsTurnOff", 
				Not GetFunctionalOption("UseContractRestrictionsForExternalUsers"));
				
			Selection = Query.Execute().Select();
			If Selection.Count() = 1 Then
				Selection.Next();
				
				CommonClientServer.SetFilterItem(ReportFilter,
					"Contract",
					Selection.Ref,
					,
					,
					True,
					DataCompositionSettingsItemViewMode.Inaccessible);
			ElsIf Selection.Count() > 1 Then
				Contracts = New Array;
				While Selection.Next() Do
					Contracts.Add(Selection.Ref);
				EndDo;
				CommonClientServer.SetFilterItem(ReportFilter, "ContractForExternalUser", Contracts);
			EndIf;
		Else
			CommonClientServer.SetFilterItem(ReportFilter,
				"Contract",
				Catalogs.CounterpartyContracts.EmptyRef(),
				,
				,
				False,
				DataCompositionSettingsItemViewMode.Inaccessible);
		EndIf;
		
		Query = New Query;
		Query.Text = "SELECT ALLOWED
		|	Companies.Ref AS Ref
		|FROM
		|	Catalog.Companies AS Companies
		|WHERE
		|	NOT Companies.DeletionMark";
		
		Selection = Query.Execute().Select();
		If Selection.Count() = 1 Then
			Selection.Next();
			
			CommonClientServer.SetFilterItem(ReportFilter,
				"Company",
				Selection.Ref,
				,
				,
				True,
				DataCompositionSettingsItemViewMode.Inaccessible);
		EndIf;
		
	EndIf;
	
EndProcedure

Procedure OnLoadUserSettingsAtServer(ReportForm, Settings) Export
	
	ExternalUserAuthorizationData = ExternalUsers.ExternalUserAuthorizationData();
	Counterparty = ExternalUserAuthorizationData.AuthorizedCounterparty;
	
	If ValueIsFilled(Counterparty) Then
		
		UserSettings = ReportForm.Report.SettingsComposer.UserSettings;
		
		If UserSettings.AdditionalProperties.Property("FormItems") Then
		
			FormItems = UserSettings.AdditionalProperties.FormItems;
			
			For Each SettingsItem In UserSettings.Items Do
				
				UserSettingID = SettingsItem.UserSettingID;
				FormItem = FormItems.Get(ReportsClientServer.CastIDToName(UserSettingID));
				
				If FormItem <> Undefined Then
					
					If FormItem.Presentation = "Counterparty" Then
						
						SettingsItem.Use = True;
						SettingsItem.RightValue = Counterparty;
						
					EndIf;
					
				EndIf;
				
			EndDo;
		
		EndIf;
		
	EndIf;
	
EndProcedure

// End StandardSubsystems.ReportsOptions

#EndRegion

#EndRegion

#EndIf
